Revit 2024 API
PanelScheduleView.RemoveSpace Method
 Remove a space at specific cell.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public void RemoveSpace(
	int nRow,
	int nCol
)
Visual Basic
Public Sub RemoveSpace ( _
	nRow As Integer, _
	nCol As Integer _
)
Visual C++
public:
void RemoveSpace(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
 Row Number
nCol
Type: System.Int32
 Column Number
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  The row column combination does not represent a valid space.
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace